/*Практика 1

1) numberOfBooks атты айнымалы ашу керек және содан соң оған қолданушының 
"Осы күнге дейін қанша кітап оқыдыңыз?" деген сұраққа жауабын салу керек.

2) bookDB атты объект ашып, оның ішіне мынадай қасиеттер саламыз:
    - count - мұнда бірінші сұрақтың жауабын теңестіреміз.
    - books - бұл жерге бос объект қоямыз
    - autors - мына жерге де бос объект
    - genres - мұнда бос массив саламыз
    - private - ал мына жерге логикалық(boolean) мән береміз, false деп

3) Қолданушыға мына сұрақтарды екі рет қайталап қойыңыз:
    - "Соңғы оқыған кітабыңыз?"
    - "Оны қаншаға бағалайсыз?"

    Жауаптарды бір айнымалыларға теңестіріп алған жөн.
    Бұл сұрақтардың жауаптарын жоғарыдағы объекттің movies 
    бөлігіне саламыз:
        books: {
            "Абай жолы": "9.0"
        }
    bookDB.books.ads
    bookDB.books[ads]
    деген секілді
*/

"use strict"

const numberOfBooks = +prompt("Осы күнге дейін қанша кітап оқыдыңыз?", "");

let bookDB = {
    count: numberOfBooks,
    books: {},
    autors: {},
    genres: [],
    private: false
}

let a = prompt("Соңғы оқыған кітабыңыз?"," "),
    b = prompt("Оны қаншаға бағалайсыз?"," "),
    c = prompt("Соңғы оқыған кітабыңыз?"," "),
    d = prompt("Оны қаншаға бағалайсыз?"," ");

bookDB.books.a = b;
bookDB["books"][c] = d;

console.log(bookDB);