/*Практика 2
    Бұл практика 1 дің жалғасы секілді болады, егер практика 1 - ді жасамаған болсаңыздар,
    жасап келулеріңізді сұраймын, немесе кодты GitHub-тан алып алыңыздар.

    1) Қолданушыға қоятын кітаптар жайлы сұрақты автоматтандыру керек.

    2) Сұрақтарға бос жауап беруге болмайды яғни сұрақтарды өткізіп кетуге 
    немесе жауап бермеуге болмайды, және жауап 50 символдан асып кетсе,
    басынан жауап бергіземіз сол сұрақтарға.

    3) Шарттар арқылы bookDB.count - ты тексеріп, егер адам 10-нан аз 
    кітап оқыса "Аздау екен", ал егер 10-30 көлемінде оқыса
    "Сіз жақсы оқырман екенсіз", ал енді 30-дан көп болса
    "Сіз нағыз кітапсүйер екенсіз" деп экранға(log) шығару керек


*/

"use strict"


const numberOfBooks = +prompt("Осы күнге дейін қанша кітап оқыдыңыз?", "");

let bookDB = {
    count: numberOfBooks,
    books: {},
    autors: {},
    genres: [],
    private: false
}

// let a = prompt("Соңғы оқыған кітабыңыз?"," "),
//     b = prompt("Оны қаншаға бағалайсыз?"," "),
//     c = prompt("Соңғы оқыған кітабыңыз?"," "),
//     d = prompt("Оны қаншаға бағалайсыз?"," ");

// bookDB.books.a = b;
// bookDB["books"][c] = d;

for(let i = 0; i < 2; i++) {
    let a = prompt("Соңғы оқыған кітабыңыз?"," "),
    b = prompt("Оны қаншаға бағалайсыз?"," ");


    console.log(bookDB);

    if(a != null && b != null && a!= " " && b != " " && a.length < 50 ) {
        bookDB.books[a] = b;
        console.log("Done!");
    }else {
        console.log("Error");
        i--;
    }
}

if(bookDB.count < 10 && bookDB.count > 0) {
    console.log("Аздау екен");
}else if(bookDB.count >= 10 && bookDB.count < 30) {
    console.log("Сіз жақсы оқырман екенсіз");
}else if(bookDB.count >= 30) {
    console.log("Сіз нағыз кітапсүйер екенсіз");
}else {
    console.log("Error!");
}